# Taps
tap "goreleaser/tap"
tap "hivemq/mqtt-cli"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "messense/macos-cross-toolchains"
tap "mongodb/brew"
tap "nitsky/stm32"
tap "osx-cross/avr"

# Brew packages
brew "cairo"
brew "gdk-pixbuf"
brew "openjdk"
brew "antlr"
brew "openssl@3"
brew "arduino-cli"
brew "openblas"
brew "arpack"
brew "asciinema"
brew "autoconf"
brew "automake"
brew "avrdude"
brew "node"
brew "aws-cdk"
brew "awscli"
brew "beanstalkd"
brew "binutils"
brew "c"
brew "calc"
brew "carthage"
brew "cdrtools"
brew "certbot"
brew "clojure"
brew "cmake"
brew "cmctl"
brew "openldap"
brew "curl"
brew "freetds"
brew "krb5"
brew "libpq"
brew "php"
brew "composer"
brew "conan"
brew "copilot"
brew "coq"
brew "coreutils"
brew "curlpp"
brew "dash"
brew "deno"
brew "djvu2pdf"
brew "docker", link: false
brew "docker-compose"
brew "doctl"
brew "dotnet"
brew "doxygen"
brew "dua-cli"
brew "folly"
brew "edencommon"
brew "elm"
brew "emscripten"
brew "epstool"
brew "esptool"
brew "etcd"
brew "fizz"
brew "wangle"
brew "fb303"
brew "fbthrift"
brew "fdk-aac-encoder"
brew "gnutls"
brew "ffmpeg"
brew "ffmpeg@4"
brew "fig2dev"
brew "fltk"
brew "fx"
brew "fzf"
brew "pkg-config"
brew "gspell"
brew "libsoup"
brew "tepl"
brew "gedit"
brew "gh"
brew "git-lfs"
brew "gjs"
brew "glade"
brew "glfw"
brew "glpk"
brew "gnupg"
brew "qt"
brew "gnuplot"
brew "go"
brew "gocr"
brew "gradle"
brew "graphicsmagick"
brew "graphviz"
brew "grep"
brew "psutils"
brew "groff"
brew "grpc"
brew "gtk4"
brew "json-glib"
brew "gstreamer"
brew "haskell-stack"
brew "helm"
brew "hey"
brew "htop"
brew "httpie"
brew "hugo"
brew "i686-elf-gcc"
brew "icarus-verilog"
brew "idris"
brew "idris2"
brew "imagesnap"
brew "influxdb-cli"
brew "ios-deploy"
brew "iproute2mac"
brew "jasmin"
brew "jpegoptim"
brew "jq"
brew "kompose"
brew "kubernetes-cli"
brew "kubectx"
brew "leveldb"
brew "libfido2"
brew "libftdi0"
brew "libhid"
brew "libhttpserver"
brew "libserialport"
brew "libtensorflow"
brew "llvm"
brew "log4cplus"
brew "lsusb"
brew "macos-term-size"
brew "mage"
brew "marp-cli"
brew "mas"
brew "maven"
brew "mdbook"
brew "media-info"
brew "meson"
brew "mingw-w64"
brew "minicom"
brew "minikube"
brew "mkdocs"
brew "mongocli"
brew "mongosh"
brew "mono"
brew "msitools"
brew "mysql"
brew "nasm"
brew "nativefier"
brew "netcat"
brew "nlohmann-json"
brew "nmap"
brew "ocrad"
brew "opam"
brew "open-ocd"
brew "vtk"
brew "opencv"
brew "openjdk@11"
brew "pandoc"
brew "pgweb"
brew "platformio"
brew "qemu"
brew "podman"
brew "virtualenv"
brew "poetry"
brew "portaudio"
brew "proxytunnel"
brew "pstree"
brew "pyenv"
brew "qt@5"
brew "rclone"
brew "redis"
brew "riscv64-elf-binutils"
brew "riscv64-elf-gcc"
brew "rtptools"
brew "rustup-init"
brew "sbt"
brew "scala"
brew "sdcc"
brew "socat"
brew "speedtest-cli"
brew "stlink"
brew "stm32flash"
brew "swaks"
brew "telnet"
brew "terraform"
brew "texinfo"
brew "tmux"
brew "traefik"
brew "tree"
brew "vala"
brew "wabt"
brew "wasmer"
brew "wasmtime"
brew "watchman"
brew "websocat"
brew "wget"
brew "xcodegen"
brew "yarn"
brew "yt-dlp"
brew "zig"
brew "hivemq/mqtt-cli/mqtt-cli"
brew "messense/macos-cross-toolchains/aarch64-unknown-linux-gnu"
brew "messense/macos-cross-toolchains/armv7-unknown-linux-gnueabihf"
brew "messense/macos-cross-toolchains/x86_64-unknown-linux-gnu"
brew "mongodb/brew/mongodb-database-tools"
brew "nitsky/stm32/arm-none-eabi-gcc"
brew "osx-cross/avr/avr-gcc@10"

# Cask packages
cask "adoptopenjdk"
cask "aldente"
cask "android-file-transfer"
cask "android-ndk"
cask "android-platform-tools"
cask "android-studio"
cask "angry-ip-scanner"
cask "anydesk"
cask "arduino-ide"
cask "balenaetcher"
cask "bartender"
cask "basictex"
cask "chai"
cask "circuitjs1"
cask "citrix-workspace"
cask "crosspack-avr"
cask "cubicsdr"
cask "cyberduck"
cask "db-browser-for-sqlite"
cask "discord"
cask "docker"
cask "drawio"
cask "emacs"
cask "firefox"
cask "flutter"
cask "font-fira-code"
cask "font-powerline-symbols"
cask "gifcapture"
cask "gimp"
cask "google-chrome"
cask "gtkwave"
cask "hex-fiend"
cask "insomnia"
cask "iterm2"
cask "keka"
cask "kekaexternalhelper"
cask "kicad"
cask "logisim-evolution"
cask "maccy"
cask "macdown"
cask "medis"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-remote-desktop"
cask "microsoft-teams"
cask "microsoft-word"
cask "mongodb-compass"
cask "mqttx"
cask "netron"
cask "ngrok"
cask "notion"
cask "openinterminal"
cask "openvpn-connect"
cask "postman"
cask "pusher"
cask "raspberry-pi-imager"
cask "rectangle"
cask "robo-3t"
cask "slack"
cask "studio-3t"
cask "tableplus"
cask "teamviewer"
cask "unnaturalscrollwheels"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "vnc-viewer"
cask "whatsapp"
cask "wireshark"
cask "xquartz"
cask "zoom"

# Mas packages
mas "ColorSlurp", id: 1287239339
mas "Developer", id: 640199958
mas "Telephone", id: 406825478
mas "TestFlight", id: 899247664
mas "Transporter", id: 1450874784
mas "Xcode", id: 497799835

# VSCode extensions
vscode "13xforever.language-x86-64-assembly"
vscode "42crunch.vscode-openapi"
vscode "ahmadalli.vscode-nginx-conf"
vscode "amodio.toggle-excluded-files"
vscode "bierner.markdown-mermaid"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "carlubian.yacc"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "cjhowe7.laravel-blade"
vscode "codezombiech.gitignore"
vscode "d-koppenhagen.file-tree-to-text-generator"
vscode "dan-c-underwood.arm"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "devsense.composer-php-vscode"
vscode "dtsvet.vscode-wasm"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "haskell.haskell"
vscode "hediet.vscode-drawio"
vscode "humao.rest-client"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jinliming2.vscode-go-template"
vscode "johnsoncodehk.vscode-tsconfig-helper"
vscode "justusadam.language-haskell"
vscode "kamikillerto.vscode-colorize"
vscode "kasik96.swift"
vscode "kelvin.vscode-sshfs"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mark-tucker.aws-cli-configure"
vscode "marp-team.marp-vscode"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-serial-monitor"
vscode "pkief.material-icon-theme"
vscode "platformio.platformio-ide"
vscode "raynigon.nginx-formatter"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rreverser.llvm"
vscode "rust-lang.rust-analyzer"
vscode "scala-lang.scala"
vscode "serayuzgur.crates"
vscode "serhioromano.vscode-st"
vscode "seyyedkhandon.firacode"
vscode "shufo.vscode-blade-formatter"
vscode "sirtobi.pegjs-language"
vscode "smusamashah.boxes"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tanhakabir.rest-book"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "ultram4rine.vscode-choosealicense"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vsciot-vscode.vscode-arduino"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-pack"
vscode "vscode-icons-team.vscode-icons"
vscode "withfig.fig"
vscode "xabikos.javascriptsnippets"
vscode "xadillax.viml"
vscode "xyc.vscode-mdx-preview"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "ziglang.vscode-zig"
vscode "zixuanchen.vitest-explorer"
vscode "zixuanwang.linkerscript"
vscode "ziyasal.vscode-open-in-github"
vscode "zjhmale.idris"
vscode "zxh404.vscode-proto3"
